ResNet(
  (avgpool): AdaptiveAvgPool2d(output_size=(1, 1))  # 2048
  (fc): Linear(in_features=2048, out_features=1000, bias=True)
)

Sequential(
  (8): AdaptiveAvgPool2d(output_size=(1, 1)) # 2048
)

ResNet(
  (avgpool): AdaptiveAvgPool2d(output_size=(1, 1)) # 2048
  (fc): Sequential(
    (0): Linear(in_features=2048, out_features=2048, bias=True)
    (1): ReLU()
    (2): Linear(in_features=2048, out_features=128, bias=True)
  )
)
